AhuraRTOS/AhuraRTOS/soc/st/stm32/soc_cb.c
/**
 * @file soc_cb.c
 * @brief SoC-owned kernel callbacks for STMicroelectronics STM32.
 *
 * A short file, and deliberately so: CMSIS-Pack startup already gives the kernel its PendSV
 * vector and SystemCoreClock, and single-core parts need no core id, IPI or spinlock.
 *
 * Everything here is weak, so one strong definition in the application replaces that callback and
 * leaves the rest. Nothing is mandatory - with the HAL absent, or the soc_config.h options off,
 * each body compiles to nothing and the kernel behaves as it does with no package at all.
 *
 * Not here on purpose: the PendSV vector name (a CubeMX setting, see doc/vendor-notes.md), and
 * programming the tick (the port does that; only the VECTOR is here).
 *
 * Why the package is shaped this way, and what an LPTIM or RTC tick would need on the L and U
 * families: doc/stm32.md, "The SoC package".
 *
 * @copyright (c) 2026 Ahura Project Contributors
 *            SPDX-License-Identifier: GPL-3.0-or-later
 *            See LICENSE in the project root for the full license text.
 */

/*
 * ***********************************************************************************************************
 * Includes
 * ***********************************************************************************************************
*/

#include "ahura.h"

/*
 * The application's SoC configuration: copy template/soc_config.h into Core/Inc beside
 * os_config.h. It is found on the include path OS_CONFIG_DIR already provides.
 *
 * REQUIRED, and so is every option in it - the same terms as os_config.h. The file holds ONLY the
 * values a user may need to decide; there are deliberately no built-in defaults, so a missing
 * option is rejected at compile time rather than silently read as 0. Whatever this package can
 * decide for itself is not in the file at all.
 */
#if defined(__has_include)
#if !__has_include("soc_config.h")
#error "No soc_config.h found: copy soc/st/stm32/template/soc_config.h into Core/Inc beside os_config.h."
#endif
#endif

#include "soc_config.h"

/*
 * ***********************************************************************************************************
 * Macros
 * ***********************************************************************************************************
*/

/* Reject an incomplete configuration rather than filling the gap: a missing option reads as 0 in
 * an #if, silently turning off the clock refresh or the timebase handling. */
#if !defined(SOC_CONFIG_HAL_HEADER) || !defined(SOC_CONFIG_CLOCK_AUTO_UPDATE) ||     \
    !defined(SOC_CONFIG_TICKLESS_HAL_TICK) || !defined(SOC_CONFIG_SYSTICK_VECTOR) || \
    !defined(SOC_CONFIG_SLEEP_MODE)
#error "soc_config.h is incomplete: it must define every option listed in soc/st/stm32/template/soc_config.h."
#endif

/* How many cores this package supports scheduling on. The STM32 range is overwhelmingly
 * single-core, and the dual-core parts that exist (H7 dual, WB, WL, MP1) pair a Cortex-M7 with a
 * Cortex-M4, or an M4 with an A7 - asymmetric designs that run two separate images rather than
 * the shared ready lists OS_CONFIG_CORE_COUNT describes. */
#define SOC_CORE_COUNT          1U

#if (OS_CONFIG_CORE_COUNT > SOC_CORE_COUNT)
#error "OS_CONFIG_CORE_COUNT is above 1, which the st/stm32 package does not support: STM32 dual-core parts are asymmetric (M7+M4), not the SMP model the kernel's core count describes."
#endif

/* A bare-CMSIS project with no HAL is a perfectly good STM32 project, so the HAL is opt-in rather
 * than assumed - but it is the application that says so, in soc_config.h, not the build guessing
 * from whether a header happens to be reachable. With it off, the clock refresh and the timebase
 * handling below compile away and the kernel behaves as it does with no package at all. */
#include SOC_CONFIG_HAL_HEADER


/*
 * ***********************************************************************************************************
 * Public function implementations
 * ***********************************************************************************************************
*/

#if (OS_CONFIG_TICKLESS_ENABLE == 1U) && (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP)
/* Defined with the LPTIM driver further down; declared here because the init callback above the
 * driver is what calls it. */
static void soc_lptim_init(void);
#endif

/******************************************************************************************************/
/**
 * @brief Prepare the SoC for the kernel. Called by os_init(), first thing.
 *
 * One job on this vendor: make sure SystemCoreClock describes the clock tree the application just
 * configured, because os_init() is about to compute the tick period from it and every
 * os_delay_us() busy-wait reads it afterwards. A stale value gives a tick at the wrong rate with
 * nothing anywhere reporting it, which is a slow and unpleasant thing to find.
 *
 * CubeMX's generated SystemClock_Config() normally leaves the variable correct already, so this
 * is insurance rather than a fix - it costs one call at start-up and makes the guarantee hold for
 * a hand-written clock setup too.
 *
 * Strong, like the RP2 package's, and for the reason the kernel's own weak default spells out: two
 * weak definitions of one symbol are not an error. The linker keeps whichever it reaches first and
 * drops the other without a word. This was weak, the kernel's empty default won that link, and it
 * went unnoticed for as long as the only thing here was SystemCoreClockUpdate() - insurance for
 * something CubeMX had already done. It stopped being unnoticeable the moment an NVIC enable was
 * added below and the LPTIM counted out every window with its interrupt still masked.
 */
void os_arch_soc_init_cb(void)
{
#if (SOC_CONFIG_CLOCK_AUTO_UPDATE != 0U)
    SystemCoreClockUpdate();
#endif

#if (OS_CONFIG_TICKLESS_ENABLE == 1U) && (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP)
    soc_lptim_init();
#endif
}

#if (OS_CONFIG_TICK_SOURCE == OS_CONFIG_TICK_SOURCE_SYSTICK) && (SOC_CONFIG_SYSTICK_VECTOR != 0U)

/******************************************************************************************************/
/**
 * @brief SysTick vector: advance the kernel clock.
 *
 * The kernel's port owns PendSV outright and used to leave this one to the application, which on
 * a CubeMX project meant the installer reaching into a generated SysTick_Handler and writing the
 * same three lines into its USER CODE section - on every project, and again after every
 * regeneration. The package writes it once instead, exactly as the raspberrypi package already
 * does for isr_systick.
 *
 * CubeMX must therefore NOT generate one: Pinout & Configuration -> System Core -> NVIC -> Code
 * generation -> uncheck 'Generate IRQ handler' for 'System tick timer'. Two definitions of one
 * symbol is a link error naming SysTick_Handler, which is a good failure - loud, immediate, and
 * it says which symbol - but the installer checks for it first and explains this rather than
 * leaving it to the linker.
 *
 * STRONG, and deliberately. The CMSIS-Pack startup file defines SysTick_Handler weak, aliased to
 * Default_Handler; between two weak definitions the linker keeps whichever it reached first, and
 * that is the startup object every time. A weak definition here would lose in silence and the
 * kernel clock would simply never advance - the same trap os_arch_soc_init_cb() above records
 * having fallen into once already.
 *
 * HAL_IncTick() is deliberately absent. The HAL runs off its own timer (CubeMX -> SYS -> Timebase
 * Source), so the two time bases never share this interrupt.
 *
 * An application that needs its own work on the tick sets SOC_CONFIG_SYSTICK_VECTOR to 0 and
 * writes SysTick_Handler itself; one that drives the kernel from a different timer entirely
 * selects OS_CONFIG_TICK_SOURCE_EXTERNAL, which removes this along with the port's SysTick
 * programming.
 *
 * @return None.
 */
void SysTick_Handler(void)
{
    os_tick_handler();
}

