AhuraRTOS/AhuraRTOS/soc/st/stm32/soc_cb.c
#endif /* OS_CONFIG_TICK_SOURCE_SYSTICK && SOC_CONFIG_SYSTICK_VECTOR */

/** Referenced by nothing, and that is its entire job.
 *
 *  A static archive gives up an object only when the link still has an undefined symbol that object
 *  defines. Everything in this file fails that test: SysTick_Handler is already DEFINED by the
 *  startup file - weakly, aliased to Default_Handler - and every _cb here has a weak default in the
 *  kernel. So there is never an unresolved reference pointing this way, the linker never extracts
 *  this object, and the whole package loses silently to those defaults.
 *
 *  What that costs is the kernel tick. SysTick's vector keeps the startup file's Default_Handler,
 *  which is `b .`: the first tick jumps into an infinite loop and the board stops dead, with
 *  os_tick_count still 0, SysTick both active and pending, and no fault recorded anywhere to say
 *  why. Found on a Nucleo-G431RB, where it froze twelve characters into the self-test banner.
 *
 *  It stayed hidden for as long as it did because OS_CONFIG_TICKLESS_ENABLE was on in every project
 *  that had run this package. os_tick.c references os_tickless_pre_sleep_cb, the kernel deliberately
 *  ships no default for it, and that one undefined symbol was enough to drag the object - and
 *  SysTick_Handler with it - into the link by accident. Turn tickless off and the accident stops.
 *
 *  soc.cmake names this symbol in a -u link option, which is what forces the extraction.
 *  Unconditional on purpose: a symbol behind the same #if as the things it rescues would disappear
 *  along with them. The raspberrypi packages carry the same anchor for the same reason. */
const uint32_t soc_stm32_anchor = 0U;


#if (OS_CONFIG_TICKLESS_ENABLE == 1U)

/*
 * ***********************************************************************************************************
 * Configuration rules
 * ***********************************************************************************************************
 *
 * Build failures rather than run-time zeros. Every way this can be set wrong fails SILENTLY on the
 * board - a window that never suppresses, a core that never wakes - and a silent fault here is
 * expensive to find. A refused build naming the settings that disagree costs nothing to read.
*/

#if (SOC_CONFIG_SLEEP_MODE != OS_CONFIG_SLEEP_MODE_LIGHT) && \
    (SOC_CONFIG_SLEEP_MODE != OS_CONFIG_SLEEP_MODE_DEEP)
#error "SOC_CONFIG_SLEEP_MODE must be OS_CONFIG_SLEEP_MODE_LIGHT or OS_CONFIG_SLEEP_MODE_DEEP."
#endif

/* No wake source to choose, and that is the whole of it: the depth decides. LIGHT leaves this
 * package supplying no source at all, and the port suppresses against SysTick itself - which is
 * exactly right, since SysTick is clocked from the core and the core clock is still running. DEEP
 * gates that clock, so the LPTIM below takes the window instead.
 *
 * The pairing that used to need checking - deep sleep against a source that dies in Stop - cannot
 * be expressed any more, so there is nothing left to check.
 *
 * An RTC wake-up timer would break the tie, being the one source that survives Stop on a series
 * with no LPTIM. When it is written, the source stops being derivable and comes back as an option
 * of its own. */

/* Deep sleep is the application's own line of HAL, because ST has no single Stop entry: the H5
 * takes a regulator argument, the L4/G4/U5 families number their Stop modes, the H7 wants a power
 * domain. Rather than an enum this package would only have to translate back into that exact call,
 * SOC_CONFIG_DEEP_SLEEP IS the call - see the comment on it in template/soc_config.h for the list
 * per series, and for the clock restore that has to follow it.
 *
 * Required only under DEEP, like the LPTIM names below: an option nothing reads is an option
 * nobody should have to fill in. Missing it is refused rather than defaulted, because the default
 * that suggests itself - a plain WFI - is precisely the light sleep this build just said it did
 * not want, and it would save nothing while reporting nothing. */
#if (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP) && !defined(SOC_CONFIG_DEEP_SLEEP)
#error "OS_CONFIG_SLEEP_MODE_DEEP needs SOC_CONFIG_DEEP_SLEEP: this series' HAL Stop entry, \
written out as the statement to run. soc/st/stm32/template/soc_config.h lists the call for every \
family."
#endif

/* Selecting the LPTIM here is only half of it: enabling the peripheral in CubeMX is what brings the
 * HAL module into the project at all. Without that step this would fail as a heap of missing
 * declarations from inside the package, which says nothing about what to do about it. */
#if (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP) && !defined(HAL_LPTIM_MODULE_ENABLED)
#error "OS_CONFIG_SLEEP_MODE_DEEP needs the LPTIM to end its windows, and this project has no \
LPTIM HAL module. In CubeMX \
enable the LPTIM named by SOC_CONFIG_TICKLESS_LPTIM_HANDLE, give it LSI or LSE as its clock, \
leave its NVIC entry OFF - the package owns that - and regenerate."
#endif


#if (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP)

/*
 * ***********************************************************************************************************
 * Tickless wake source: LPTIM
 * ***********************************************************************************************************
 *
 * The kernel asks "wake me in N ticks", then "how many ticks really passed".
 *
 * The counter that answers both never stops and is never reset. It is started once, wraps freely
 * over its full range, and a window is a pair of readings from it; the wake is a compare against
 * the value the window should end at. Everything between the two readings is inside the
 * measurement, the time spent arming included.
 *
 * That last point is the design, and it was learned the hard way. An earlier version restarted the
 * timer for each window, and the restart cost about eighteen LPTIM periods of flag waits - REPOK,
 * ARROK, DIEROK, each up to three low-speed cycles - spent with the counter stopped at zero. Half a
 * millisecond of real time per window that no clock in the system was counting. Over twenty
 * eight-tick windows the kernel clock fell ten ticks behind the CPU's own counter: a 6% error on a
 * short window, and under 1% on a long one, which is why it hid so well. A running counter cannot
 * lose time it is not asked about.
 *
 * So nothing is written to DIER once the timer is going and nothing is ever stopped. Arming is one
 * write to the compare register.
 *
 * The peripheral belongs to CubeMX - clock, LSI or LSE mux, prescaler, handle. This borrows it,
 * takes the NVIC entry because the vector has to reach the kernel, and sets the reload to the full
 * range, because a window measured as a difference wants the longest unambiguous span it can get.
*/

/** CubeMX generates one handle per enabled instance, named for it. Borrowed rather than
 *  re-initialised: a second HAL_LPTIM_Init() would fight MX_LPTIM1_Init() for the same registers.
 *
 *  Taken by NAME from soc_config.h rather than built here from an instance number. Pasting a digit
 *  onto a prefix looks tidier and is wrong across the range: the G0 folds LPTIM1 into
 *  TIM6_DAC_LPTIM1_IRQn, so the handle, the NVIC entry and the vector are three independent facts
 *  about a project and only the project can state them.
 *
 *  Aliased rather than used directly, so the rest of this file reads as SOC_LPTIM_* and none of it
 *  has to know where the names came from. */
extern LPTIM_HandleTypeDef          SOC_CONFIG_TICKLESS_LPTIM_HANDLE;

#define SOC_LPTIM_HANDLE            (&SOC_CONFIG_TICKLESS_LPTIM_HANDLE)
#define SOC_LPTIM_IRQN              SOC_CONFIG_TICKLESS_LPTIM_IRQN
#define SOC_LPTIM_IRQ_HANDLER       SOC_CONFIG_TICKLESS_LPTIM_VECTOR

