AhuraRTOS/AhuraRTOS/soc/st/stm32/soc_cb.c
/** A rate this high cannot be a low-power clock: it is the reset default, PCLK3, which means the
 *  CubeMX clock mux was never pointed at LSI or LSE. Left alone it would count the core clock -
 *  dying in any sleep deeper than the lightest, and reaching a window of well under one tick. */
#if (SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ > 1000000UL)
#error "SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ is too high to be a low-speed clock. In CubeMX, Clock \
Configuration tab, point the LPTIM1 mux at LSI or LSE - the default is PCLK3."
#endif

/** The prescaler, pinned here rather than taken from CubeMX, and pinned to /1 - the counter runs
 *  at its source rate.
 *
 *  Pinned rather than configurable because a bigger divider is a bad trade at this tick rate. It
 *  buys a longer window, but arming one waits for the compare write to cross into the counter's
 *  clock domain - three of the PRESCALED periods - so that wait scales straight with the divider.
 *  Measured on an H503 at 32 kHz: 94 us to arm at /1, 3.0 ms at /32. Three milliseconds of
 *  busy-wait with the kernel mask held is most of an 8 ms window, and a board set that way stops
 *  sleeping through short windows at all - its kernel clock falls behind and its interrupt latency
 *  grows by the same 3 ms.
 *
 *  A window longer than the 2047 ticks this gives is not refused, it is just taken in hops: the
 *  kernel clamps each window to the ceiling, so a 5 s delay wakes three times and lands on time.
 *
 *  Written here at all - rather than left to CubeMX - because it used to be CubeMX's while
 *  SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ restated its result by hand, and the two disagreeing made
 *  every window the wrong length with nothing to say so. With the divider pinned they cannot
 *  disagree: that option is simply what the counter counts at.
 *
 *  Written once in soc_lptim_init(), before HAL_LPTIM_Init(), never touched again: this driver's
 *  design rests on a counter started once and never stopped, and changing a prescaler means
 *  stopping it. */
#define SOC_LPTIM_PRESCALER         LPTIM_PRESCALER_DIV1

/** Counts in one kernel tick, ROUNDED DOWN. Used only where a rough size is wanted - the arming
 *  floor below - and deliberately not for measuring a window: see soc_lptim_accum for why one
 *  pre-divided constant cannot express this ratio and what is used instead. Refused below if it
 *  comes out as 0. */
#define SOC_LPTIM_COUNTS_PER_TICK   (SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ / OS_CONFIG_TICK_HZ)

#if (SOC_LPTIM_COUNTS_PER_TICK == 0U)
#error "SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ is slower than OS_CONFIG_TICK_HZ, so one kernel tick \
is less than one LPTIM count and no window could be expressed. Use a faster low-speed clock or a \
slower tick."
#endif

/** The counter's full span: its wrap point, and the modulus every window difference is taken
 *  against. */
#define SOC_LPTIM_PERIOD            0xFFFFUL

/** Ceiling on one window, in counts: three quarters of the span, leaving a quarter as headroom.
 *
 *  The resume path takes its difference modulo the span, so a core still asleep past the compare -
 *  a masked NVIC line, a debugger halt - wraps it and reports a full window as an empty one, and
 *  every deadline then runs late by the difference. A quarter of the span is half a second at
 *  32 kHz. Costs nothing: the ceiling goes from ~2047 ticks to 1536, and windows are bounded by the
 *  next expiry long before this. */
#define SOC_LPTIM_MAX_COUNTS        (((SOC_LPTIM_PERIOD + 1UL) * 3UL) / 4UL)

/** What one window costs to arm, in counts. The compare write takes three low-speed periods to
 *  reach the counter's clock domain and the arming path waits for it; one more is carried for the
 *  read and the arithmetic around it. Everything else - the WFI, the wake, the counter read - is
 *  core-clock work and disappears next to a single low-speed period. */
#define SOC_LPTIM_ARM_COUNTS        4UL

/** Polls allowed while a register write reaches the low-speed domain. Three LPTIM periods is what
 *  it takes, which against a fast core is a great many instructions; the bound is only there so a
 *  clock that never starts cannot hold the idle path forever. */
#define SOC_LPTIM_CMPOK_POLLS       100000UL

/*
 * ***********************************************************************************************************
 * Two generations of LPTIM HAL, one driver
 * ***********************************************************************************************************
 *
 * ST rewrote the LPTIM HAL part-way through the range, and the two versions are not
 * source-compatible. Everything below is written against the difference rather than against one of
 * them, because a package that says "STM32" and only builds on half of it is worse than one that
 * says which half.
 *
 *   CHANNELLED (H5, U5, H7 recent, WBA)   The compare belongs to a channel: LPTIM_CHANNEL_1, its
 *                                         own CC1/CMP1OK flags, an Init.Period field, and
 *                                         HAL_LPTIM_PWM_Start_IT(h, channel). Writes to DIER are
 *                                         themselves acknowledged, through DIEROK.
 *   LEGACY (G0, G4, L0, L4, L5, F7, WB)   One compare, no channels: CMPM/CMPOK, no Init.Period -
 *                                         the reload is an argument to
 *                                         HAL_LPTIM_PWM_Start_IT(h, Period, Pulse) - and no DIEROK.
 *
 * LPTIM_CHANNEL_1 is the discriminator: it exists only in the channelled headers. What is shared -
 * HAL_LPTIM_Init, HAL_LPTIM_ReadCounter, HAL_LPTIM_IRQHandler, the CompareMatch and
 * AutoReloadMatch callbacks, __HAL_LPTIM_GET_FLAG and __HAL_LPTIM_CLEAR_FLAG - is used directly
 * and appears nowhere here.
 */
#if defined(LPTIM_CHANNEL_1)

#define SOC_LPTIM_FLAG_MATCH        LPTIM_FLAG_CC1
#define SOC_LPTIM_FLAG_CMPOK        LPTIM_FLAG_CMP1OK
#define SOC_LPTIM_COMPARE_SET(v)    __HAL_LPTIM_COMPARE_SET(SOC_LPTIM_HANDLE, LPTIM_CHANNEL_1, (v))
#define SOC_LPTIM_START_IT()        HAL_LPTIM_PWM_Start_IT(SOC_LPTIM_HANDLE, LPTIM_CHANNEL_1)

/* The reload is a handle field here, applied by HAL_LPTIM_Init. */
#define SOC_LPTIM_PERIOD_APPLY()    do { SOC_LPTIM_HANDLE->Init.Period = SOC_LPTIM_PERIOD; } while (0)

/* CMP1OK is not wanted as an interrupt: every window writes the compare register and the arming
 * path waits on that very flag, so a handler would clear it before the wait could see it and the
 * interrupt left pending would drop the following sleep straight back out. Disabling it is itself a
 * DIER write, which this generation acknowledges through DIEROK - hence the wait. */
#define SOC_LPTIM_QUIET_CMPOK()                                                                   \
    do {                                                                                          \
        __HAL_LPTIM_CLEAR_FLAG(SOC_LPTIM_HANDLE, LPTIM_FLAG_DIEROK);                              \
        __HAL_LPTIM_DISABLE_IT(SOC_LPTIM_HANDLE, LPTIM_IT_CMP1OK);                                \
        soc_lptim_write_settle(LPTIM_FLAG_DIEROK);                                                \
    } while (0)

#else

#define SOC_LPTIM_FLAG_MATCH        LPTIM_FLAG_CMPM
#define SOC_LPTIM_FLAG_CMPOK        LPTIM_FLAG_CMPOK
#define SOC_LPTIM_COMPARE_SET(v)    __HAL_LPTIM_COMPARE_SET(SOC_LPTIM_HANDLE, (v))

/* Period and Pulse are start-up arguments rather than handle fields. The pulse is 0 because no
 * output pin is routed; the first real compare is written by the first window. */
#define SOC_LPTIM_START_IT()        HAL_LPTIM_PWM_Start_IT(SOC_LPTIM_HANDLE, SOC_LPTIM_PERIOD, 0U)
#define SOC_LPTIM_PERIOD_APPLY()    do { } while (0)

/* Same reasoning as the channelled branch, minus the DIEROK acknowledgement this generation does
 * not have: the DIER write here takes effect directly. */
#define SOC_LPTIM_QUIET_CMPOK()                                                                   \
    do {                                                                                          \
        __HAL_LPTIM_DISABLE_IT(SOC_LPTIM_HANDLE, LPTIM_IT_CMPOK);                                 \
    } while (0)

