AhuraRTOS/AhuraRTOS/soc/st/stm32/soc_cb.c
#endif /* LPTIM_CHANNEL_1 */

/** Counter reading the open window started from. */
static uint32_t soc_lptim_start = 0U;

/** Counts the open window was armed for; 0 when no window is open. */
static uint32_t soc_lptim_armed = 0U;

/** Time this driver has measured but not yet announced, in counts x OS_CONFIG_TICK_HZ.
 *
 * Two separate errors used to live where this now sits, and neither was visible in a single window.
 *
 *  1. SOC_LPTIM_COUNTS_PER_TICK is an integer division. At the usual 32768 Hz against a 1 kHz tick
 *     it is 32, so a "tick" measured against it is 32/32768 s = 976.6 us rather than 1000. Every
 *     window therefore ran the kernel clock 2.4% FAST, while SysTick outside the window kept it
 *     right - an error that changes sign depending on how much of the second was spent asleep.
 *  2. The leftover counts of the final, incomplete tick were dropped: elapsed was a truncating
 *     division and the next window re-read its reference from the counter, so up to a whole tick
 *     went missing per window - this time SLOW. The two did not cancel; their sum moved with the
 *     workload.
 *
 * Scaling by OS_CONFIG_TICK_HZ instead of pre-dividing removes both. A count is worth TICK_HZ
 * units and a tick is worth SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ of them, which is exact for every
 * ratio including the ones that are not whole. What is left after the whole ticks are taken out
 * stays here and is spent by a later window, so the announced time converges on the real elapsed
 * time rather than drifting away from it at a fixed rate.
 *
 * Always below SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ, by construction. 64-bit because the
 * multiplication is by a frequency and this is the idle path, where one library division per
 * WINDOW - not per tick - costs nothing worth counting. */
static uint64_t soc_lptim_accum = 0U;

/******************************************************************************************************/
/**
 * @brief Counts to wait for a given number of whole kernel ticks. Rounded UP: a window must never
 *        end before the tick it was asked for.
 *
 * soc_lptim_accum is deliberately NOT subtracted here, and getting that wrong is worth a note
 * because it looks like the symmetric thing to do and it is not. The accumulator holds time that has
 * already ELAPSED and merely has not been announced yet - it sits behind the reference this window
 * is about to take. The kernel deadline is ticks from NOW. Netting the accumulator off makes the
 * window end that much before the deadline, while os_arch_tick_resume_cb() adds the same amount back
 * into elapsed - so the kernel is told a full window passed when it did not. The clock then runs
 * fast, every deadline looks nearer than it is, and the next window is planned shorter still. On the
 * H503 that fed back until a 50-tick sleep measured 5.
 *
 * @param[in] ticks  Kernel ticks the window should cover.
 * @return uint32_t  Counts to arm.
 */
static uint32_t soc_lptim_ticks_to_counts(uint32_t ticks)
{
    uint64_t wanted = (uint64_t)ticks * (uint64_t)SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ;

    return (uint32_t)((wanted + (uint64_t)OS_CONFIG_TICK_HZ - 1U) / (uint64_t)OS_CONFIG_TICK_HZ);
}

/******************************************************************************************************/
/**
 * @brief Read the counter as one whole sample.
 *
 * CNT is clocked in the low-speed domain and read from the bus, so a single read can catch it
 * mid-update. Two equal reads in a row is the reference manual's answer. It matters more here than
 * it would with a counter that restarted every window: a torn sample of a free-running counter does
 * not produce a slightly wrong elapsed, it produces an absurd one.
 *
 * HAL_LPTIM_ReadCounter is the single read, so the repetition is this function's job.
 *
 * @return uint32_t  Counter value.
 */
static uint32_t soc_lptim_count_get(void)
{
    uint32_t first;
    uint32_t second;

    do
    {
        first  = HAL_LPTIM_ReadCounter(SOC_LPTIM_HANDLE);
        second = HAL_LPTIM_ReadCounter(SOC_LPTIM_HANDLE);
    } while (first != second);

    return second;
}

/******************************************************************************************************/
/**
 * @brief Wait, with a bound, for a register write to reach the low-speed domain.
 *
 * Writes to the LPTIM's compare and interrupt registers cross into the counter's own clock domain
 * and are not live until the matching flag says so; a second write over one still in flight is
 * lost. Three low-speed periods is what the reference manual asks for. The poll bound is not a
 * timeout in any useful sense - it is there so that a clock which never starts cannot hold the idle
 * path forever.
 *
 * @param[in] flag  SOC_LPTIM_FLAG_CMPOK, or LPTIM_FLAG_DIEROK where that generation has one.
 * @return None.
 */
static void soc_lptim_write_settle(uint32_t flag)
{
    uint32_t polls = 0U;

    while ((__HAL_LPTIM_GET_FLAG(SOC_LPTIM_HANDLE, flag) == 0U) && (polls < SOC_LPTIM_CMPOK_POLLS))
    {
        polls++;
    }
}

/******************************************************************************************************/
/**
 * @brief Start the counter and take the interrupt vector. Called once, from os_arch_soc_init_cb().
 *
 * Everything expensive lives here so that arming a window later is a single register write.
 *
 * @return None.
 */
static void soc_lptim_init(void)
{
    /* The least urgent level there is, which is where the port also puts SysTick and for a stronger
     * version of the same reason: the tick at least does scheduling bookkeeping, while this handler
     * does nothing at all. Neither has any business delaying a device interrupt.
     *
     * The wake does not depend on the priority. A WFI leaves on a pending interrupt even while the
     * kernel mask holds it off, so the core is running again before this ever executes. */
    NVIC_SetPriority(SOC_LPTIM_IRQN, (1UL << __NVIC_PRIO_BITS) - 1UL);
    NVIC_EnableIRQ(SOC_LPTIM_IRQN);

