AhuraRTOS/AhuraRTOS/soc/st/stm32/soc_cb.c
    /* CubeMX picks a reload for whatever it imagined the timer was for; a free-running counter wants
     * the whole range. The rest of the handle - clock source, prescaler - is left as generated,
     * which is the part CubeMX is authoritative about. */
    SOC_LPTIM_PERIOD_APPLY();
    SOC_LPTIM_HANDLE->Init.Clock.Prescaler = SOC_LPTIM_PRESCALER;

    if (HAL_LPTIM_Init(SOC_LPTIM_HANDLE) == HAL_OK)
    {
        /* Continuous counting with a compare interrupt, started and never stopped again. The name
         * describes the output waveform, which is nothing to do with this: no LPTIM output pin is
         * routed. What matters is the order inside, which is the order the peripheral insists on
         * and which this driver got wrong by hand - enable, then the interrupt enables with their
         * DIEROK wait around them, then the compare channel, then start.
         *
         * The wrap interrupt comes with it. That fires once per full span of the counter, which is
         * the same 2 seconds as the longest window this source will ever be asked for, so it costs
         * at most one extra wake per window and usually none. */
        if (SOC_LPTIM_START_IT() == HAL_OK)
        {
            /* The compare-ok interrupt is not wanted; see SOC_LPTIM_QUIET_CMPOK above for why, and
             * for what each HAL generation needs in order to do it. ARROK, REPOK and UPDATE are
             * left as they are: they answer writes to registers this driver never touches after
             * start-up. */
            SOC_LPTIM_QUIET_CMPOK();
        }
    }
}

/******************************************************************************************************/
/**
 * @brief The LPTIM vector.
 *
 * @return None.
 */
void SOC_LPTIM_IRQ_HANDLER(void)
{
    HAL_LPTIM_IRQHandler(SOC_LPTIM_HANDLE);
}

/******************************************************************************************************/
/**
 * @brief HAL's compare-match callback - the end of a window. Deliberately empty.
 *
 * The wake is the whole product. How long the window really was is read from the counter when the
 * kernel asks, not recorded here, so a callback that arrives late - or not at all, because another
 * interrupt woke the core first - cannot change the answer.
 *
 * @param[in] hlptim  The instance HAL is reporting for.
 * @return None.
 */
void HAL_LPTIM_CompareMatchCallback(LPTIM_HandleTypeDef *hlptim)
{
    (void)hlptim;
}

/******************************************************************************************************/
/**
 * @brief HAL's wrap callback. Empty for the same reason, and this one is not even a window ending -
 *        just the free-running counter going round.
 *
 * @param[in] hlptim  The instance HAL is reporting for.
 * @return None.
 */
void HAL_LPTIM_AutoReloadMatchCallback(LPTIM_HandleTypeDef *hlptim)
{
    (void)hlptim;
}

/******************************************************************************************************/
/**
 * @brief How many ticks one window may skip.
 *
 * @return uint32_t  Ceiling in ticks.
 */
uint32_t os_arch_tick_suppress_max_cb(void)
{
    /* Whole ticks that fit in the longest window this counter can express, on the same exact ratio
     * soc_lptim_accum uses. The pre-divided form this replaced answered 2048 where the counter can
     * really only hold 1999 (at 32768 Hz / 1 kHz): the kernel then planned a window the arming path
     * silently clamped, and reported the shortfall as time that never happened. */
    return (uint32_t)(((uint64_t)SOC_LPTIM_MAX_COUNTS * (uint64_t)OS_CONFIG_TICK_HZ) /
                      (uint64_t)SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ);
}

/******************************************************************************************************/
/**
 * @brief The shortest window worth sleeping through.
 *
 * A window has to last longer than it takes to set up, or the sleep costs more than it saves. Here
 * that is the compare write settling in the low-speed domain, rounded up to whole ticks.
 *
 * At the usual ratio - a 32 kHz source against a 1 kHz tick - this is one tick, well under the two
 * the kernel insists on anyway, so it decides nothing. It starts deciding when the ratio moves: a
 * faster tick, or a source divided down by a prescaler, and a couple of counts is suddenly several
 * ticks.
 *
 * Deep sleep does not add a term here, and the reason is arithmetic rather than principle: Stop
 * exit on this family is tens of microseconds, and a clock restore behind it a couple of hundred
 * more, against a floor the kernel already holds at two whole tick periods. A part with a slower
 * wake, or an application whose SOC_CONFIG_DEEP_SLEEP relocks a long-settling PLL, is where the
 * term starts to bind - measure it before adding it.
 *
 * @return uint32_t  Floor on one window, in ticks.
 */
uint32_t os_arch_tick_suppress_min_cb(void)
{
    return (uint32_t)((SOC_LPTIM_ARM_COUNTS + (uint32_t)SOC_LPTIM_COUNTS_PER_TICK - 1UL) /
                      (uint32_t)SOC_LPTIM_COUNTS_PER_TICK);
}

/******************************************************************************************************/
/**
 * @brief Open a window of `ticks` tick periods.
 *
 * @param[in] ticks  Tick periods to sleep.
 * @return None.
 */
void os_arch_tick_suppress_cb(uint32_t ticks)
{
    uint32_t counts = soc_lptim_ticks_to_counts(ticks);

    if (counts > SOC_LPTIM_MAX_COUNTS)
    {
        counts = SOC_LPTIM_MAX_COUNTS;
    }

    /* Read before anything else: this is where the window starts, and every microsecond after it -
     * the compare write, the wait below, the sleep itself - is inside what gets measured. */
    soc_lptim_start = soc_lptim_count_get();
    soc_lptim_armed = counts;

    /* Cleared before the new target is written rather than after. The old target is still live for
     * the length of the wait below, so it could match in there and leave a flag that wakes this
     * window instantly - a wasted idle pass, and harmless. Clearing afterwards would instead risk
     * discarding a real match, which is a sleep that never ends. */
    __HAL_LPTIM_CLEAR_FLAG(SOC_LPTIM_HANDLE, SOC_LPTIM_FLAG_MATCH);
    __HAL_LPTIM_CLEAR_FLAG(SOC_LPTIM_HANDLE, SOC_LPTIM_FLAG_CMPOK);

    /* The peripheral flag and the NVIC's latched pending bit are two separate things, and clearing
     * the first above leaves the second exactly where it was. That matters here and almost nowhere
     * else: a WFI with anything already pending is a no-op, so a bit left over from the window that
     * just ended drops the sleep below straight back out. Under LIGHT that costs one wasted idle
     * pass; under DEEP it is a Stop mode that is never entered at all, with every power figure it
     * was chosen for quietly failing to appear and nothing saying why.
     *
     * Nothing is lost by clearing it. The match it refers to has already been paid for - the kernel
     * measures a window from the counter, never from this interrupt - and the new target goes in on
     * the next line, so a real match from here on sets the bit again and ends the sleep. */
    NVIC_ClearPendingIRQ(SOC_LPTIM_IRQN);

    SOC_LPTIM_COMPARE_SET((soc_lptim_start + counts) & (uint32_t)SOC_LPTIM_PERIOD);

    /* Waited out rather than left to land during the sleep, because the next window can arrive
     * sooner than three low-speed periods and a compare written over one still in flight is lost.
     * It costs nothing in accuracy: the counter is running through the wait, so the wait is inside
     * the window being measured. Which is the whole point of this driver. */
    soc_lptim_write_settle(SOC_LPTIM_FLAG_CMPOK);
}

/******************************************************************************************************/
/**
 * @brief Close the window and report the whole tick periods that really elapsed.
 *
 * @return uint32_t  Whole tick periods since os_arch_tick_suppress_cb().
 */
uint32_t os_arch_tick_resume_cb(void)
{
    uint32_t elapsed = 0U;

