AhuraRTOS/AhuraRTOS/soc/st/stm32/soc_cb.c
    if (soc_lptim_armed != 0U)
    {
        /* The counter never stopped, so one subtraction is the entire window: the arming, the
         * sleep, and whatever ended it. Masked to the counter's span, which is what makes a wrap
         * inside the window come out right. */
        uint32_t counts = (soc_lptim_count_get() - soc_lptim_start) & (uint32_t)SOC_LPTIM_PERIOD;

        /* Banked first, then spent. The whole ticks come out; the fraction of a tick that is left
         * stays in the accumulator for the next window instead of being thrown away, which is what
         * stops the clock losing up to a tick every time it sleeps. See soc_lptim_accum. */
        soc_lptim_accum += (uint64_t)counts * (uint64_t)OS_CONFIG_TICK_HZ;

        elapsed = (uint32_t)(soc_lptim_accum / (uint64_t)SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ);

        soc_lptim_accum -= (uint64_t)elapsed * (uint64_t)SOC_CONFIG_TICKLESS_LPTIM_CLOCK_HZ;
        soc_lptim_armed  = 0U;
    }

    return elapsed;
}

#endif /* SOC_CONFIG_SLEEP_MODE_DEEP */

/* SysTick is the port's own, so this package supplies none of the three suppress callbacks for it
 * - os_arch_port_v8m.c reprograms the reload itself. The weak defaults in the port answer 0, which
 * is exactly right: nothing here to arm, nothing here to measure. */

/******************************************************************************************************/
/**
 * @brief Called right before the idle sleep: stop the HAL timebase so the sleep runs its length.
 *
 * This is the one thing that makes tickless idle worth enabling on an STM32, and the reason it
 * needs saying is that leaving the hook empty fails silently rather than loudly.
 *
 * The kernel owns SysTick, which means CubeMX has been told to run the HAL from a spare timer
 * (SYS -> Timebase Source). That timer keeps firing at its own period, 1 kHz by default, and WFI
 * wakes on any pending interrupt whether or not it is masked. So a sleep the kernel planned for
 * 500 ms ends after 1 ms, every time, and tickless idle looks like it simply does not work.
 *
 * HAL_SuspendTick() is ST's own hook for this. HAL_GetTick() does not advance while suspended,
 * which loses no time - the counter just does not run while the CPU is asleep - but it does mean
 * a HAL driver's own timeout cannot be relied on across the sleep window.
 *
 * Deliberately does NOT select a deeper mode, and that is not the omission it once was: how deep
 * the core goes is SOC_CONFIG_DEEP_SLEEP, run by os_arch_soc_sleep_cb() below at the moment of
 * the sleep. It has to be there rather than here, because the wake source is not armed yet when
 * this runs - os_arch_sleep_prepare() does that on the line after - and a Stop entered from here
 * would have nothing left to end it.
 */
OS_WEAK void os_tickless_pre_sleep_cb(void)
{
#if (SOC_CONFIG_TICKLESS_HAL_TICK != 0U)
    HAL_SuspendTick();
#endif
}

/******************************************************************************************************/
/**
 * @brief Called right after wakeup: restart the HAL timebase.
 *
 * Runs with the kernel's interrupts still masked and before the sleep has been announced, so it
 * must stay short: its whole duration is added to interrupt latency.
 *
 * The clock restore a Stop mode needs does NOT go here - it is already done, in
 * os_arch_soc_sleep_cb() below, on the instruction after the wake. By the time this runs the
 * tree is back and HAL_ResumeTick() is resuming against the clock it was configured for.
 */
OS_WEAK void os_tickless_post_sleep_cb(void)
{
#if (SOC_CONFIG_TICKLESS_HAL_TICK != 0U)
    HAL_ResumeTick();
#endif
}

/******************************************************************************************************/
/**
 * @brief The sleep itself: a plain WFI under LIGHT, this series' own Stop entry under DEEP.
 *
 * Called with the window already armed - the tick silenced, the LPTIM counting the wake out - which
 * is what makes a Stop mode safe to enter here and nowhere else in the idle path. The LPTIM runs
 * from LSI or LSE, so it counts straight through Stop; the pairing rule at the top of this file is
 * what guarantees the source under it is one of those.
 *
 * Under DEEP this is one statement the application wrote, run verbatim. The package does not wrap
 * it, check it or undo it afterwards: ST's Stop entries already set SLEEPDEEP, execute the WFI and
 * clear SLEEPDEEP again on the way out, and anything else the mode costs - a clock restore above
 * all - belongs in the same statement, where it runs before this returns.
 *
 * Strong rather than weak, and for the reason os_arch_soc_init_cb() spells out at the top of this
 * file: two weak definitions of one symbol are not an error, the linker keeps whichever it reaches
 * first, and the one it dropped would be this. A build that silently linked the kernel's WFI
 * instead would enter no Stop mode at all and report nothing.
 *
 * @return None.
 */
#if (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP)
/* CubeMX generates this into main.c on every project it makes, and generates it NON-static -
 * it simply never puts a prototype in main.h. Declared here rather than asking each application
 * to edit a generated header. A project that has no such function fails to LINK, naming the
 * symbol, and only under DEEP: write your own SystemClock_Config() that reprograms the tree, or
 * turn the deep sleep off. */
void SystemClock_Config(void);
#endif

void os_arch_soc_sleep_cb(void)
{
#if (SOC_CONFIG_SLEEP_MODE == OS_CONFIG_SLEEP_MODE_DEEP)
    SOC_CONFIG_DEEP_SLEEP();

    /* Stop gates the PLL and drops the core onto HSI or CSI, so the wake returns to a machine
     * running at a fraction of the speed it went to sleep at - and nothing anywhere reports it.
     * The tick period, every UART baud rate and every os_delay_us() would be wrong from here to
     * the end of the run. Putting the clock back is not optional, which is exactly why it is in
     * the package rather than left as a line for each application to remember.
     *
     * Here and not in os_tickless_post_sleep_cb(), which is only microseconds later: the elapsed
     * measurement between them, and HAL_ResumeTick() inside it, would run against a clock tree
     * that is not the one they were set up for.
     *
     * Two costs, both real and neither obvious. HSE and the PLL have to relock, measured at
     * about 35000 core cycles per window on an H503 - charged to interrupt latency, since the
     * kernel mask is still held. And HAL_RCC_ClockConfig() ends by refreshing SystemCoreClock
     * through HAL_RCC_GetSysClockFreq(), which on the H5 and several other families computes
     * the PLL ratio in FLOAT. That sets CONTROL.FPCA on whichever task ran the sleep, and every
     * later context switch of that task carries the FP register file: about 63 cycles more each
     * way, for the life of the task. Normally that task is idle and it costs nothing anyone can
     * measure; it is worth knowing before driving a deep sleep by hand from a latency-critical
     * one. */
    SystemClock_Config();
#else
    OS_ARCH_IDLE();
#endif
}

#endif /* OS_CONFIG_TICKLESS_ENABLE */
